#### SketchedStairsCurveData Members

---

|  |
| --- |
| SketchedStairsCurveData Class   Constructors   Methods   Properties   See Also |

The  SketchedStairsCurveData  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | SketchedStairsCurveData | Construct a SketchedStairsCurveData defined by a curve associated with its height and slope type. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  SketchedStairsCurveData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCurve | Get a copy of the curve that is formed along this boundary. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

SketchedStairsCurveData Class

Autodesk.Revit.DB Namespace